Repository: bjork/woocommerce_payment_module
Catalog: languages/wc-maksuturva-*.po
Languages: fi_fi

source: Shipping cost
fi_fi: Toimituskulut

source: Discount
fi_fi: Alennus

source: WooCommerce Maksuturva Payment Gateway
fi_fi: Maksuturvan maksunvälityspalvelu

source: Settings
fi_fi: Asetukset

source: Take payments via Maksuturva.
fi_fi: Vastaanota maksuja Maksuturvan kautta.

source: Gateway Disabled
fi_fi: Välityspalvelu pois käytöstä

source: Maksuturva does not support your store currency.
fi_fi: Maksuturva ei tue kaupan valuuttayksikköä.

source: Maksuturva Error: Please enter your Maksuturva seller id and secret key
fi_fi: Maksuturvan virhe: Syötä Maksuturvan kauppiastunnuksesi ja salainen avaimesi

source: Enable/Disable
fi_fi: Ota käyttöön / poista käytöstä

source: Enable Maksuturva Payment Gateway
fi_fi: Käytä Maksuturvan maksunvälitystä

source: Title
fi_fi: Palvelun nimi

source: This controls the title which the user sees during checkout.
fi_fi: Asiakas näkee tämän nimen kassalla.

source: Customer Message
fi_fi: Viesti asiakkaalle

source: Pay via Maksuturva.
fi_fi: Maksa käyttäen Maksuturvaa

source: Sandbox mode
fi_fi: Käytä yleistä testitunnusta

source: Maksuturva sandbox can be used to test payments. None of the payments will be real.
fi_fi: Sandbox-moodia voidaan käyttää testaamiseen. Mitään maksuja ei suoriteta.

source: Debug Log
fi_fi: Debug-loki

source: Seller id
fi_fi: Kauppiastunnus

source: The seller identification provided by Maksuturva upon your registration.
fi_fi: Kauppiastunnus, jonka saa rekisteröityessä Maksuturvaan kauppiaaksi.

source: Secret Key
fi_fi: Salainen avain

source: Your unique secret key provided by Maksuturva.
fi_fi: Maksuturvan toimittama salainen avain

source: Secret Key Version
fi_fi: Salaisen avaimen versio

source: The version of the secret key provided by Maksuturva.
fi_fi: Maksuturvan toimittaman avaimen versio.

source: Gateway URL
fi_fi: Välityspalvelun URL

source: The URL used to communicate with Maksuturva. Do not change this configuration unless you know what you are doing.
fi_fi: URL, jota käytetään Maksuturvan kanssa. Yleensä tätä ei pidä muuttaa.

source: Use eMaksut payment service instead of Maksuturva
fi_fi: Käytä eMaksut-palvelua.

source: Thank you for your order. We are now redirecting you to Maksuturva to make payment.
fi_fi: Kiitos tilauksestasi. Ohjaamme sinut nyt Maksuturvan sivuille maksamista varten.

source: Cancel order &amp; restore cart
fi_fi: Peruuta tilaus ja palauta ostoskori

source: Payment confirmed by Maksuturva.
fi_fi: Maksuturva on varmentanut maksun.

source: Message from Maksuturva return
fi_fi: Viesti Maksuturvasta

source: Go back to checkout
fi_fi: Palaa kassalle

source: Maksuturva returned missing information.
fi_fi: Maksuturvan paluuviestistä puuttuu tietoja.

source: Maksuturva returned wrong information / hash code.
fi_fi: Maksuturva palautti väärät tiedot tai tarkiste on väärin.

source: Error from Maksuturva received.
fi_fi: Maksuturva palautti virheen.

source: Cancellation from Maksuturva received.
fi_fi: Peruutettu Maksuturvassa.

source: Payment delayed by Maksuturva.
fi_fi: Viivästetty maksu Maksuturvassa.

source: Payment cancelled by sandbox customer.
fi_fi: Yleinen testikäyttäjä peruutti maksun.

source: Thank you - your order is now pending payment. You should be automatically redirected to Maksuturva to make payment.
fi_fi: Kiitos - tilauksesi odottaa maksamista. Ohjaamme sinut Maksuturvan sivuille maksamista varten.

source: Payment confirmed by Maksuturva/eMaksut.
fi_fi: Maksuturva/eMaksut varmensi maksun.

source: Payment cancelled by customer.
fi_fi: Asiakas peruutti maksun.

source: Waiting for payment confirmation by Maksuturva/eMaksut.
fi_fi: Odotetaan varmistusta maksulle.

source: Verify pending payments
fi_fi: Varmenna odottavat maksut

source: Open KauppiasExtranet to view payments
fi_fi: Katso maksuja KauppiasExtranetissä

source: View orders payments
fi_fi: Selaa tilausten maksuja

source: List for verified pending payments
fi_fi: Maksua odottavat maksut

source: Order ID
fi_fi: Tilausnumero

source: Message from Maksuturva
fi_fi: Viesti Maksuturvalta

source: A plugin for Maksuturva, which provides intelligent online payment services consisting of the most comprehensive set of high quality service features in the Finnish market
fi_fi: Maksuturva on maksupalveluntarjoaja, jonka älykäs palvelukokonaisuus vastaa vaativankin verkkokaupan tarpeisiin.

source: Enable logging to <code>%s</code>
fi_fi: Kirjoita lokia tiedostoon <code>%s</code>

source: Maksuturva Payment Prefix
fi_fi: Maksun etuliite

source: Prefix for order identifiers. Can be used to generate unique payment ids after e.g. reinstall.
fi_fi: Maksun etuosa, joka lisätään maksutapahtuman numeroon. Voidaan käyttää yksilöimään maksutapahtumat esimerkiksi Woocommercen uudelleenasennuksen jälkeen, mikäli Maksuturva palauttaa virheitä päällekkäisistä tilausnumeroista.

source: Waiting for payment
fi_fi: Odotetaan maksua

source: Check pending payments
fi_fi: Tarkista odottavat maksut Maksuturvasta

source: Show admin options
fi_fi: Palaa asetuksiin

source: Original prices do not match with response.
fi_fi: Alkuperäiset hinnat eivät vastaa vastauksen arvoja.

source: Error: order not found on Maksuturva
fi_fi: Virhe: tilausta ei löydy Maksuturvasta

source: Once every 5 minutes
fi_fi: Viiden minuutin välein

source: Error:
fi_fi: Virhe:

source: Response code
fi_fi: Paluukoodi

source: Unfortunately your order cannot be processed as the originating bank/merchant has declined your transaction.
fi_fi: Valitettavasti tilausta ei voida käsitellä, koska maksaminen epäonnistui.

source: Notice that the plugin does not support woocommerce versions after than 2.2.10. Please do not upgrade woocommerce without new version of the Maksuturva plugin.
fi_fi: HUOM! Moduuli ei tue WooCommerce-verkkokaupan versiota 2.2.10 uudempia versioita. Älä päivitä WooCommercea ilman uutta WooCommercea tukevaa versiota Maksuturva-moduulista.
